app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "updated_at", "user_id", "content") VALUES('2011-12-06 08:37:14.141129', '2011-12-06 08:37:14.141129', 3, E'This is one more coments from my side') RETURNING "id"
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 14)
UPDATE "comments" SET "updated_at" = '2012-01-11 16:00:41.283301', "content" = E'article for include vs join', "user_id" = 2 WHERE "id" = 14
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])